{
  "basic-link": "The fo:basic-link is used for representing the start resource\n  of a simple link.",
  "bidi-override": "The fo:bidi-override inline formatting object is used where\n  it is necessary to override the default Unicode-bidirectionality\n  algorithm direction for different (or nested) inline scripts in\n  mixed-language documents.",
  "block": "The fo:block formatting object is commonly used for formatting\n  paragraphs, titles, headlines, figure and table captions, etc.",
  "block-container": "The fo:block-container flow object is used to generate a\n   block-level reference-area.",
  "character": "The fo:character flow object represents a character that is\n   mapped to a glyph for presentation.",
  "color-profile": "Used to declare a color profile for a stylesheet.",
  "conditional-page-master-reference": "The fo:conditional-page-master-reference\n   is used to identify a page-master that is to be used when the conditions\n   on its use are satisfied.",
  "declarations": "Used to group global declarations for a stylesheet.",
  "external-graphic": "The fo:external-graphic flow object is used for a graphic\n   where the graphics data resides outside of the XML result tree in the\n   fo namespace.",
  "float": "The fo:float serves two purposes. It can be used so that during the\n   normal placement of content, some related content is formatted into a\n   separate area at beginning of the page (or of some following page) where\n   it is available to be read without immediately intruding on the reader.\n   Alternatively, it can be used when an area is intended to float to one\n   side, with normal content flowing alongside.",
  "flow": "The content of the fo:flow formatting object is a sequence\n  of flow objects that provides the flowing text content that is distributed\n  into pages.",
  "footnote": "The fo:footnote is used to produce a footnote citation and the\n  corresponding footnote.",
  "footnote-body": "The fo:footnote-body is used to generate the content of the\n  footnote.",
  "initial-property-set": "The fo:initial-property-set specifies formatting properties\n  for the first line of an fo:block.",
  "inline": "The fo:inline formatting object is commonly used for\n  formatting a portion of text with a background or enclosing it in a\n  border.",
  "inline-container": "The fo:inline-container flow object is used to generate an\n  inline reference-area.",
  "instream-foreign-object": "The fo:instream-foreign-object flow object is used for an\n  inline graphic or other \"generic\" object where the object data resides\n  as descendants of the fo:instream-foreign-object.",
  "layout-master-set": "The fo:layout-master-set is a wrapper around all masters used\n  in the document.",
  "leader": "The fo:leader formatting object is used to generate leaders\n  consisting either of a rule or of a row of a repeating character or\n  cyclically repeating pattern of characters that may be used for connecting\n  two text formatting objects.",
  "list-block": "The fo:list-block flow object is used to format a list.",
  "list-item": "The fo:list-item formatting object contains the label and the\n  body of an item in a list.",
  "list-item-body": "The fo:list-item-body formatting object contains the content\n  of the body of a list-item.",
  "list-item-label": "The fo:list-item-label formatting object contains the content\n  of the label of a list-item; typically used to either enumerate, identify,\n  or adorn the list-item's body.",
  "marker": "The fo:marker is used in conjunction with fo:retrieve-marker\n  to produce running headers or footers.",
  "multi-case": "The fo:multi-case is used to contain (within an fo:multi-switch)\n  each alternative sub-tree of formatting objects among which the parent\n  fo:multi-switch will choose one to show and will hide the rest.",
  "multi-properties": "The fo:multi-properties is used to switch between two or more\n  property sets that are associated with a given portion of content.",
  "multi-property-set": "The fo:multi-property-set is used to specify an alternative\n  set of formatting properties that, dependent on a User Agent state, are\n  applied to the content.",
  "multi-switch": "The fo:multi-switch wraps the specification of alternative\n  sub-trees of formatting objects (each sub-tree being within an\n  fo:multi-case), and controls the switching (activated via fo:multi-toggle)\n  from one alternative to another.",
  "multi-toggle": "The fo:multi-toggle is used within an fo:multi-case to switch\n  to another fo:multi-case.",
  "page-number": "The fo:page-number formatting object is used to represent the\n  current page-number.",
  "page-number-citation": "The fo:page-number-citation is used to reference the\n  page-number for the page containing the first normal area returned by the\n  cited formatting object.",
  "page-sequence": "The fo:page-sequence formatting object is used to specify how\n  to create a (sub-)sequence of pages within a document; for example, a\n  chapter of a report. The content of these pages comes from flow children\n  of the fo:page-sequence.",
  "page-sequence-master": "The fo:page-sequence-master specifies sequences of page-masters\n  that are used when generating a sequence of pages.",
  "region-after": "This region defines a viewport that is located on the \"after\"\n  side of fo:region-body region.",
  "region-before": "This region defines a viewport that is located on the \"before\"\n  side of fo:region-body region.",
  "region-body": "This region specifies a viewport/reference pair that is located\n  in the \"center\" of the fo:simple-page-master.",
  "region-end": "This region defines a viewport that is located on the \"end\"\n  side of fo:region-body region.",
  "region-start": "This region defines a viewport that is located on the \"start\"\n  side of fo:region-body region.",
  "repeatable-page-master-alternatives": "An fo:repeatable-page-master-alternatives specifies a\n  sub-sequence consisting of repeated instances of a set of alternative\n  page-masters. The number of repetitions may be bounded or potentially\n  unbounded.",
  "repeatable-page-master-reference": "An fo:repeatable-page-master-reference specifies a sub-sequence\n  consisting of repeated instances of a single page-master. The number of\n  repetitions may be bounded or potentially unbounded.",
  "retrieve-marker": "The fo:retrieve-marker is used in conjunction with fo:marker\n  to produce running headers or footers.",
  "root": "The fo:root node is the top node of an XSL result tree. This\n  tree is composed of formatting objects.",
  "simple-page-master": "The fo:simple-page-master is used in the generation of pages\n  and specifies the geometry of the page. The page may be subdivided into\n  up to five regions.",
  "single-page-master-reference": "An fo:single-page-master-reference specifies a sub-sequence\n  consisting of a single instance of a single page-master.",
  "static-content": "The fo:static-content formatting object holds a sequence or a\n  tree of formatting objects that is to be presented in a single region or\n  repeated in like-named regions on one or more pages in the page-sequence.\n  Its common use is for repeating or running headers and footers.",
  "table": "The fo:table flow object is used for formatting the tabular\n  material of a table.",
  "table-and-caption": "The fo:table-and-caption flow object is used for formatting a\n  table together with its caption.",
  "table-body": "The fo:table-body formatting object is used to contain the\n  content of the table body.",
  "table-caption": "The fo:table-caption formatting object is used to contain\n  block-level formatting objects containing the caption for the table only\n  when using the fo:table-and-caption.",
  "table-cell": "The fo:table-cell formatting object is used to group content to\n  be placed in a table cell.",
  "table-column": "The fo:table-column formatting object specifies characteristics\n  applicable to table cells that have the same column and span.",
  "table-footer": "The fo:table-footer formatting object is used to contain the\n  content of the table footer.",
  "table-header": "The fo:table-header formatting object is used to contain the\n  content of the table header.",
  "table-row": "The fo:table-row formatting object is used to group table-cells\n  into rows.",
  "title": "The fo:title formatting object is used to associate a title with\n  a given document. This title may be used by an interactive User Agent to\n  identify the document. For example, the content of the fo:title can be\n  formatted and displayed in a \"title\" window or in a \"tool tip\".",
  "wrapper": "The fo:wrapper formatting object is used to specify inherited\n  properties for a group of formatting objects. It has no additional\n  formatting semantics."
}
